// Первое задание
alert('Привет, это работа Хлопенковой Татьяны');

// Второе задание
let planet = 'Земля';
let age = 20;

alert(planet);
alert(age);

// Третье задание
let name = 'Таня';
let surname = 'Хлопенкова';

alert("Привет, меня зовут " + name + " " + surname + ", мне " + age + " лет");

//Четвертое задание
let reviewer = prompt('Как Вас зовут?', "Игорь");
alert("Мою работу проверяет " + reviewer);

//Пятое задание
//  1. Чему будут равны переменные (a, b, c и d) в примере ниже?
//  let a = 1, b = 1;
//  let c = ++a;
//  let d = b++;

//  Ответ: a = 2, b = 2, c = 2, d = 1

// 2. Чему будут равны переменные (a, b, x, у) после исполнения кода в примере ниже?
//  let a = 3;
//  let b = 2;
//  let x = 1 + (a += 2);
//  let y = 1 + (b *= 2);

// Ответ: a = 5, b = 4, x = 6, y = 5